{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Задача 1\n",
    "Преобразуйте математическое выражение, указанное ниже, в выражение на языке Python и укажите результат его вычисления в поле ввода ответа."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-0.28407460545193686\n"
     ]
    }
   ],
   "source": [
    "print(((-12)+(6/17))/((1+2)**4-5*8))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Задача 2\n",
    "\n",
    "Напишите программу, которая вычисляет долю студентов, получивших оценку A.\n",
    "\n",
    "Используется пятибальная система оценивания с оценками A, B, C, D, F.\n",
    "\n",
    "Формат ввода:\n",
    "Строка, в которой через пробел записаны оценки студентов. Оценок всегда не меньше одной.\n",
    "\n",
    "Формат вывода:\n",
    "Дробное число с ровно двумя знаками после запятой."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0.00\n"
     ]
    }
   ],
   "source": [
    "def excellent_work(string):\n",
    "    sum = 0\n",
    "    count = 0\n",
    "    for i in string.split(\" \"):\n",
    "        sum += 1\n",
    "        if i == \"A\":\n",
    "            count += 1\n",
    "\n",
    "    return round(count/sum, 2)\n",
    "\n",
    "\n",
    "user_input = str(input())\n",
    "\n",
    "print('{0:.2f}'.format(excellent_work(user_input)))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Примечание к предудыщей задаче: Интересный формат вывода надо был почитать **'{0:.2f}'.format()**"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Задача 3\n",
    "\n",
    "Напишите программу, которая принимает на вход список чисел и число, после чего выводит все позиции, на которых это число встречается в переданном списке.\n",
    "\n",
    "Позиции в списке нумеруются с нуля.\n",
    "Если число x не найдено в списке, нужно вывести строку \"None\" (без кавычек, с большой буквы).\n",
    "\n",
    "Формат ввода:\n",
    "На первой строке содержатся значения списка -- целые числа, разделённые пробелом. На второй строке содержится целое число, позиции которого нужно найти.\n",
    "\n",
    "Формат вывода:\n",
    "Одна строка, в которой содержится слово \"None\" или через пробел перечислены числа -- позиции, на которых число x встречается в списке lst. Позиции должны быть выведены в порядке возрастания."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0 "
     ]
    }
   ],
   "source": [
    "def finder(string, number):\n",
    "    mylist = []\n",
    "    position = 0\n",
    "    if string.count(str(number)) == 0:\n",
    "        return print(None)\n",
    "    \n",
    "    else:\n",
    "        for i in string.split(\" \"):\n",
    "            if int(i) == number:\n",
    "                return print(position, end=' ')\n",
    "            position += 1\n",
    "\n",
    "\n",
    "a = str(input())\n",
    "b = int(input())\n",
    "finder(a, b)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##  Задача 4\n",
    "\n",
    "Кодирование длин серий — это базовый алгоритм сжатия данных.\n",
    "\n",
    "В этой задаче мы реализуем алгоритм дешифровки строк, закодированных с помощью одного из самых простых  вариантов кодирования длин серий.\n",
    "\n",
    "На вход алгоритму подаётся строка, содержащая цифры и символы латинского алфавита. Эта строка разбивается на так называемые \"серии\", которые кодируются парой число-символ или просто символ (в таком случае число считается равным единице). Результат должен содержать эти серии в том же порядке, что они и встречаются в исходной строке, при этом каждая серия раскрывается в последовательность символов соответствующей длины. \n",
    "\n",
    "Например, рассмотрим строку \n",
    "\n",
    "3ab4c2CaB\n",
    "\n",
    "Разобъём её на серии\n",
    "\n",
    "3a b 4c 2C a B\n",
    "\n",
    "После чего преобразуем серии и получим исходную закодированную строку:\n",
    "\n",
    "aaabccccCCaB\n",
    "\n",
    "Формат ввода:\n",
    "Одна строка, содержащая закодированную последовательность.\n",
    "\n",
    "Формат вывода:\n",
    "Строка, содержащая раскодированную последовательность."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3ab\n"
     ]
    }
   ],
   "source": [
    "def splintercell(string):\n",
    "    n = str(1)\n",
    "    position = 0\n",
    "    result = str()\n",
    "    for i in range(len(string)):\n",
    "        if string[i].isnumeric() is True:\n",
    "            if i == 0:\n",
    "                n = (str(string[i]))\n",
    "            else:\n",
    "                if string[i-1].isnumeric() is True:\n",
    "                    n += string[i]\n",
    "                else: \n",
    "                    n = string[i]\n",
    "        else:\n",
    "            result += int(n) * string[i]\n",
    "            n = '1'\n",
    "\n",
    "    return result\n",
    "            \n",
    "a = str(input())\n",
    "\n",
    "print(splintercell(a))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Задача 5\n",
    "Fizz Buzz -- это классическая задача на программирование. Вот её немного изменённое условие.\n",
    "\n",
    "Напишите программу, которая принимает на вход два целых числа: начало и конец отрезка (оба числа входят в отрезок).\n",
    "\n",
    "Программа должна вывести числа из этого отрезка, но если число делится на 3, то вывести вместо него Fizz, если число делится на 5, вывести вместо него Buzz, а если делится и на три, и на 5, то вывести вместо этого числа FizzBuzz.\n",
    "\n",
    "Формат ввода:\n",
    "Два целых числа через пробел.\n",
    "\n",
    "Формат вывода:\n",
    "На отдельной строке каждое число из отрезка или слово, его заменяющее."
   ]
  }
 ],
 "metadata": {
  "interpreter": {
   "hash": "aee8b7b246df8f9039afb4144a1f6fd8d2ca17a180786b69acc140d282b71a49"
  },
  "kernelspec": {
   "display_name": "Python 3.9.7 64-bit",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.9"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
